Revit 2026 API

# IFCTransformSetter Properties

---

The IFCTransformSetter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

IFCTransformSetter Class

Autodesk.Revit.DB.IFC Namespace